; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	thermograph2 - mode
	infrared1 - mode
	image3 - mode
	infrared5 - mode
	infrared0 - mode
	Star2 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation0 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument3 thermograph2)
	(supports instrument3 image4)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph2)
	(supports instrument4 image3)
	(supports instrument4 infrared5)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared5)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(have_image Planet8 thermograph2)
	(have_image Planet8 infrared0)
	(have_image Planet9 thermograph2)
	(have_image Star10 infrared1)
	(have_image Star10 infrared0)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 image4)
	(have_image Star13 infrared0)
	(have_image Star13 infrared1)
	(have_image Star14 image3)
))

)

; plan
1. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite3 instrument3 star7)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite3 phenomenon12 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon12)
   goals met: 0 of 10
4. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 0 of 10
5. (take_image satellite3 phenomenon12 instrument3 image4)
   added: (have_image phenomenon12 image4)
   goals met: 1 of 10
6. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 10
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
8. (calibrate satellite1 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 1 of 10
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 10
10. (turn_to satellite0 planet8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet8)
   goals met: 1 of 10
11. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 2 of 10
12. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 2 of 10
13. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 3 of 10
14. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 3 of 10
15. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 4 of 10
16. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 4 of 10
17. (take_image satellite1 planet8 instrument1 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 5 of 10
18. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 5 of 10
19. (take_image satellite1 planet9 instrument1 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 6 of 10
20. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 6 of 10
21. (take_image satellite1 star10 instrument1 infrared1)
   added: (have_image star10 infrared1)
   goals met: 7 of 10
22. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 7 of 10
23. (take_image satellite1 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 8 of 10
24. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 8 of 10
25. (take_image satellite1 star13 instrument1 infrared1)
   added: (have_image star13 infrared1)
   goals met: 9 of 10
26. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 9 of 10
27. (take_image satellite1 star14 instrument1 image3)
   added: (have_image star14 image3)
   goals met: 10 of 10
